STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213dxx_cm33.h
/**
  * @brief System configuration controller
  */
typedef struct
{
  __IO uint32_t BOOTSR;             /*!< SYSCFG boot pin status register                             Address offset: 0x0000 */
  __IO uint32_t BOOTCR;             /*!< SYSCFG boot pin control register                            Address offset: 0x0004 */
       uint32_t RESERVED377[254];   /*!< Reserved                                                    Address offset: 0x0008-0x03FC */
  __IO uint32_t DLYBSD1CR;          /*!< SYSCFG DLYBSD1 control register                             Address offset: 0x0400 */
  __IO uint32_t DLYBSD1SR;          /*!< SYSCFG DLYBSD1 status register                              Address offset: 0x0404 */
  __IO uint32_t SDMMC1CR;           /*!< SYSCFG SDMMC1 control register                              Address offset: 0x0408 */
  __IO uint32_t SDMMC1ARCR;         /*!< SYSCFG SDMMC1 address remapping control register            Address offset: 0x040C */
       uint32_t RESERVED378[252];   /*!< Reserved                                                    Address offset: 0x0410-0x07FC */
  __IO uint32_t DLYBSD2CR;          /*!< SYSCFG DLYBSD2 control register                             Address offset: 0x0800 */
  __IO uint32_t DLYBSD2SR;          /*!< SYSCFG DLYBSD2 status register                              Address offset: 0x0804 */
  __IO uint32_t SDMMC2CR;           /*!< SYSCFG SDMMC2 control register                              Address offset: 0x0808 */
  __IO uint32_t SDMMC2ARCR;         /*!< SYSCFG SDMMC2 address remapping control register            Address offset: 0x080C */
       uint32_t RESERVED379[252];   /*!< Reserved                                                    Address offset: 0x0810-0x0BFC */
  __IO uint32_t DLYBSD3CR;          /*!< SYSCFG DLYBSD3 control register                             Address offset: 0x0C00 */
  __IO uint32_t DLYBSD3SR;          /*!< SYSCFG DLYBSD3 status register                              Address offset: 0x0C04 */
       uint32_t RESERVED380;        /*!< Reserved                                                    Address offset: 0x0C08 */
  __IO uint32_t SDMMC3ARCR;         /*!< SYSCFG SDMMC3 address remapping control register            Address offset: 0x0C0C */
       uint32_t RESERVED381[252];   /*!< Reserved                                                    Address offset: 0x0C10-0x0FFC */
  __IO uint32_t DLYBOS1CR;          /*!< SYSCFG DLYBOS1 control register                             Address offset: 0x1000 */
  __IO uint32_t DLYBOS1SR;          /*!< SYSCFG DLYBOS1 status register                              Address offset: 0x1004 */
       uint32_t RESERVED382[254];   /*!< Reserved                                                    Address offset: 0x1008-0x13FC */
  __IO uint32_t DLYBOS2CR;          /*!< SYSCFG DLYBOS2 control register                             Address offset: 0x1400 */
  __IO uint32_t DLYBOS2SR;          /*!< SYSCFG DLYBOS2 status register                              Address offset: 0x1404 */
       uint32_t RESERVED383[254];   /*!< Reserved                                                    Address offset: 0x1408-0x17FC */
  __IO uint32_t VDENPURAMCR;        /*!< SYSCFG video decoder and npu RAM control register           Address offset: 0x1800 */
  __IO uint32_t POTTAMPRSTCR;       /*!< SYSCFG potential tamper reset control register              Address offset: 0x1804 */
       uint32_t RESERVED384[254];   /*!< Reserved                                                    Address offset: 0x1808-0x1BFC */
  __IO uint32_t M33SSCR;            /*!< SYSCFG M33SS control register                               Address offset: 0x1C00 */
       uint32_t RESERVED385[255];   /*!< Reserved                                                    Address offset: 0x1C04-0x1FFC */
  __IO uint32_t ICNQPCR1;           /*!< SYSCFG ICN QOS priority control register 1                  Address offset: 0x2000 */
  __IO uint32_t ICNQPCR2;           /*!< SYSCFG ICN QOS priority control register 2                  Address offset: 0x2004 */
  __IO uint32_t ICNEWRCR;           /*!< SYSCFG ICN early write response control register            Address offset: 0x2008 */
  __IO uint32_t ICNCGCR;            /*!< SYSCFG ICN clock gating control register                    Address offset: 0x200C */
  __IO uint32_t ICNGPUBWLCR;        /*!< SYSCFG ICN GPU bandwidth limiter control register           Address offset: 0x2010 */
  __IO uint32_t ICNE2EBWRCR;        /*!< SYSCFG ICN end-to-end bandwidth regulation control register Address offset: 0x2014 */
  __IO uint32_t SAFERSTCR;          /*!< SYSCFG safe reset control register                          Address offset: 0x2018 */
       uint32_t RESERVED386;        /*!< Reserved                                                    Address offset: 0x201C */
  __IO uint32_t ICNETHBWLCR;        /*!< SYSCFG ICN ETH bandwidth limiter control register           Address offset: 0x2020 */
       uint32_t RESERVED387;        /*!< Reserved                                                    Address offset: 0x2024 */
  __IO uint32_t ICNCPU1BWLCR;       /*!< SYSCFG ICN CPU1 bandwidth limiter control register          Address offset: 0x2028 */
  __IO uint32_t ICNLTDCBWLCR;       /*!< SYSCFG ICN LTDC bandwidth limiter control register          Address offset: 0x202C */
  __IO uint32_t ICNDCMIPPBWLCR;     /*!< SYSCFG ICN DCMIPP bandwidth limiter control register        Address offset: 0x2030 */
  __IO uint32_t ICNVDEBWLCR;        /*!< SYSCFG ICN Video Decoder bandwidth limiter control register Address offset: 0x2034 */
       uint32_t RESERVED388[6];     /*!< Reserved                                                    Address offset: 0x2038-0x204C */
  __IO uint32_t HPDMAARCR;          /*!< SYSCFG HPDMA address remapping control register             Address offset: 0x2050 */
       uint32_t RESERVED389[235];   /*!< Reserved                                                    Address offset: 0x2054-0x23FC */
  __IO uint32_t USB2PHY1CR;         /*!< SYSCFG USB2PHY1 control register                            Address offset: 0x2400 */
  __IO uint32_t USB2PHY1BCCR;       /*!< SYSCFG USB2PHY1 battery charging control register           Address offset: 0x2404 */
  __IO uint32_t USB2PHY1BCSR;       /*!< SYSCFG USB2PHY1 battery charging status register            Address offset: 0x2408 */
  __IO uint32_t USB2PHY1TRIM1CR;    /*!< SYSCFG USB2PHY1 trimming 1 control register                 Address offset: 0x240C */
  __IO uint32_t USB2PHY1TRIM2CR;    /*!< SYSCFG USB2PHY1 trimming 2 control register                 Address offset: 0x2410 */
       uint32_t RESERVED390[3];     /*!< Reserved                                                    Address offset: 0x2414-0x241C */
  __IO uint32_t USBHCR;             /*!< SYSCFG USBH control register                                Address offset: 0x2420 */
  __IO uint32_t USBHARCR;           /*!< SYSCFG USBH address remapping control register              Address offset: 0x2424 */
       uint32_t RESERVED391[246];   /*!< Reserved                                                    Address offset: 0x2428-0x27FC */
  __IO uint32_t USB2PHY2CR;         /*!< SYSCFG USB2PHY2 control register                            Address offset: 0x2800 */
       uint32_t RESERVED392;        /*!< Reserved                                                    Address offset: 0x2804 */
  __IO uint32_t USB2PHY2TRIM1CR;    /*!< SYSCFG USB2PHY2 trimming 1 control register                 Address offset: 0x2808 */
  __IO uint32_t USB2PHY2TRIM2CR;    /*!< SYSCFG USB2PHY2 trimming 2 control register                 Address offset: 0x280C */
       uint32_t RESERVED393[5];     /*!< Reserved                                                    Address offset: 0x2810-0x2820 */
  __IO uint32_t OTGARCR;            /*!< SYSCFG OTG address remapping control register               Address offset: 0x2824 */
       uint32_t RESERVED394[246];   /*!< Reserved                                                    Address offset: 0x2828-0x2BFC */
  __IO uint32_t OCTOSPIAMCR;        /*!< SYSCFG OCTOSPI address mapping control register             Address offset: 0x2C00 */
       uint32_t RESERVED395[255];   /*!< Reserved                                                    Address offset: 0x2C04-0x2FFC */
  __IO uint32_t ETH1CR;             /*!< SYSCFG Ethernet1 control register                           Address offset: 0x3000 */
       uint32_t RESERVED396[3];     /*!< Reserved                                                    Address offset: 0x3004-0x300C */
  __IO uint32_t ETH1SR;             /*!< SYSCFG Ethernet1 status register                            Address offset: 0x3010 */
       uint32_t RESERVED397[251];   /*!< Reserved                                                    Address offset: 0x3014-0x33FC */
  __IO uint32_t ETH2CR;             /*!< SYSCFG Ethernet2 configuration register                     Address offset: 0x3400 */
       uint32_t RESERVED398[3];     /*!< Reserved                                                    Address offset: 0x3404-0x340C */
  __IO uint32_t ETH2SR;             /*!< SYSCFG Ethernet2 status register                            Address offset: 0x3410 */
       uint32_t RESERVED399[763];   /*!< Reserved                                                    Address offset: 0x3414-0x3FFC */
  __IO uint32_t VDDIO3CCCR;         /*!< SYSCFG VDDIO3 compensation cell control register            Address offset: 0x4000 */
  __IO uint32_t VDDIO3CCSR;         /*!< SYSCFG VDDIO3 compensation cell status register             Address offset: 0x4004 */
  __IO uint32_t VDDIO4CCCR;         /*!< SYSCFG VDDIO4 compensation cell control register            Address offset: 0x4008 */
  __IO uint32_t VDDIO4CCSR;         /*!< SYSCFG VDDIO4 compensation cell status register             Address offset: 0x400C */
  __IO uint32_t VDDCCCR;            /*!< SYSCFG VDD compensation cell control register               Address offset: 0x4010 */
  __IO uint32_t VDDCCSR;            /*!< SYSCFG VDD compensation cell status register                Address offset: 0x4014 */
  __IO uint32_t VDDIO2CCCR;         /*!< SYSCFG VDDIO2 compensation cell control register            Address offset: 0x4018 */
  __IO uint32_t VDDIO2CCSR;         /*!< SYSCFG VDDIO2 compensation cell status register             Address offset: 0x401C */
  __IO uint32_t VDDIO1CCCR;         /*!< SYSCFG VDDIO1 compensation cell control register            Address offset: 0x4020 */
  __IO uint32_t VDDIO1CCSR;         /*!< SYSCFG VDDIO1 compensation cell status register             Address offset: 0x4024 */
       uint32_t RESERVED400[246];   /*!< Reserved                                                    Address offset: 0x4028-0x43FC */
  __IO uint32_t CBR;                /*!< SYSCFG control timer break register                         Address offset: 0x4400 */
       uint32_t RESERVED401[767];   /*!< Reserved                                                    Address offset: 0x4404-0x4FFC */
  __IO uint32_t DISPLAYCLKCR;       /*!< SYSCFG display clock control register                       Address offset: 0x5000 */
       uint32_t RESERVED402[255];   /*!< Reserved                                                    Address offset: 0x5004-0x53FC */
  __IO uint32_t HDPUSBDBGCR;        /*!< SYSCFG HDP USB debug control register                       Address offset: 0x5400 */
       uint32_t RESERVED403[1023];  /*!< Reserved                                                    Address offset: 0x5404-0x63FC */
  __IO uint32_t IDC;                /*!< SYSCFG device ID register                                   Address offset: 0x6400 */
       uint32_t RESERVED404[1788];  /*!< Reserved                                                    Address offset: 0x6404-0x7FF0 */
  __IO uint32_t VERR;               /*!< SYSCFG version register                                     Address offset: 0x7FF4 */
  __IO uint32_t IPIDR;              /*!< SYSCFG identification register                              Address offset: 0x7FF8 */
  __IO uint32_t SIDR;               /*!< SYSCFG size identification register                         Address offset: 0x7FFC */
} SYSCFG_TypeDef;
