STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213dxx_cm33.h
#define DDRC                        DDRC_S
#define DDRC_BASE                   DDRC_BASE_S

#define DDRDBG                      DDRDBG_S
#define DDRDBG_BASE                 DDRDBG_BASE_S

#define DDRPERFM                    DDRPERFM_S
#define DDRPERFM_BASE               DDRPERFM_BASE_S

#define STGENR                      STGENR_S
#define STGENR_BASE                 STGENR_BASE_S

#define STGENC                      STGENC_S
#define STGENC_BASE                 STGENC_BASE_S

/*!< FMC Banks registers defaults to Secure aliases */
#define FMC_Bank1_R                 FMC_Bank1_R_S
#define FMC_Bank1_R_BASE            FMC_Bank1_R_BASE_S

#define FMC_Bank1E_R                FMC_Bank1E_R_S
#define FMC_Bank1E_R_BASE           FMC_Bank1E_R_BASE_S

#define FMC_Bank3_R                 FMC_Bank3_R_S
#define FMC_Bank3_R_BASE            FMC_Bank3_R_BASE_S

#define FMC_Common_R                FMC_Common_R_S
#define FMC_Common_R_BASE           FMC_Common_R_BASE_S

#define SDMMC1                      SDMMC1_S
#define SDMMC1_BASE                 SDMMC1_BASE_S

#define SDMMC2                      SDMMC2_S
#define SDMMC2_BASE                 SDMMC2_BASE_S

#define SDMMC3                      SDMMC3_S
#define SDMMC3_BASE                 SDMMC3_BASE_S
#define ETH1                        ETH1_S
#define ETH1_BASE                   ETH1_BASE_S
#define ETH2                        ETH2_S
#define ETH2_BASE                   ETH2_BASE_S

#define USBH_OHCI                   USBH_OHCI_S
#define USBH_OHCI_BASE              USBH_OHCI_BASE_S

#define USBH_EHCI                   USBH_EHCI_S
#define USBH_EHCI_BASE              USBH_EHCI_BASE_S

#define USBDR                       USBDR_S
#define USBDR_BASE                  USBDR_BASE_S

#define CA35SYSCFG                  CA35SYSCFG_S
#define CA35SYSCFG_BASE             CA35SYSCFG_BASE_S

#define DDRPHYC_BASE                DDRPHYC_BASE_S

#define DBGMCU                      DBGMCU_S
#define DBGMCU_BASE                 DBGMCU_BASE_S

/*!< AHB6 peripherals defaults to Secure aliases */
/*!< Device electronic signature memory map */
#define UID_BASE                   (0x54000014UL)            /*!< Unique Device ID register base address */
#define PACKAGE_BASE               (0x540001E8UL)            /*!< Package Data register base address */
#define RPN_BASE                   (0x54000024UL)            /*!< Device Part Number register base address */
#define DV_BASE                    (0x5A010000UL)            /*!< Device Version register base address */

#else /*  CORTEX_IN_SECURE_STATE */
/*!< Peripherals base addresses defaults to Non secure aliases */
#define PERIPH_BASE                 PERIPH_BASE_NS

/*!< Memory base addresses defaults to Non secure aliases */
#define SRAMS_BASE                  SRAMS_BASE_NS

#define SYSRAM_BASE                 SYSRAM_BASE_NS
#define SRAM1_BASE                  SRAM1_BASE_NS
#define NPURAM_BASE                 NPURAM_BASE_NS
#define RETRAM_BASE                 RETRAM_BASE_NS
#define BKP_SRAM_BASE               BKP_SRAM_BASE_NS
#define CAN_SRAM_BASE               CAN_SRAM_BASE_NS

#define SRAMS_FETCH_BASE            SRAMS_FETCH_BASE_NS

/*!< APB1 peripherals defaults to Non secure aliases */
#define TIM2                        TIM2_NS
#define TIM2_BASE                   TIM2_BASE_NS

#define TIM3                        TIM3_NS
#define TIM3_BASE                   TIM3_BASE_NS

#define TIM4                        TIM4_NS
#define TIM4_BASE                   TIM4_BASE_NS

#define TIM5                        TIM5_NS
#define TIM5_BASE                   TIM5_BASE_NS

#define TIM6                        TIM6_NS
#define TIM6_BASE                   TIM6_BASE_NS

#define TIM7                        TIM7_NS
#define TIM7_BASE                   TIM7_BASE_NS

#define TIM12                       TIM12_NS
#define TIM12_BASE                  TIM12_BASE_NS

#define TIM13                       TIM13_NS
#define TIM13_BASE                  TIM13_BASE_NS

#define TIM14                       TIM14_NS
#define TIM14_BASE                  TIM14_BASE_NS

#define LPTIM1                      LPTIM1_NS
#define LPTIM1_BASE                 LPTIM1_BASE_NS

#define LPTIM2                      LPTIM2_NS
#define LPTIM2_BASE                 LPTIM2_BASE_NS

#define SPI2                        SPI2_NS
#define SPI2_BASE                   SPI2_BASE_NS

#define SPI3                        SPI3_NS
#define SPI3_BASE                   SPI3_BASE_NS

#define SPDIFRX                     SPDIFRX_NS
#define SPDIFRX_BASE                SPDIFRX_BASE_NS

#define USART2                      USART2_NS
#define USART2_BASE                 USART2_BASE_NS

#define USART3                      USART3_NS
#define USART3_BASE                 USART3_BASE_NS

#define UART4                       UART4_NS
#define UART4_BASE                  UART4_BASE_NS

#define UART5                       UART5_NS
#define UART5_BASE                  UART5_BASE_NS

#define I2C1                        I2C1_NS
#define I2C1_BASE                   I2C1_BASE_NS

#define I2C2                        I2C2_NS
#define I2C2_BASE                   I2C2_BASE_NS

#define I2C3                        I2C3_NS
#define I2C3_BASE                   I2C3_BASE_NS

#define I3C1                        I3C1_NS
#define I3C1_BASE                   I3C1_BASE_NS

#define I3C2                        I3C2_NS
#define I3C2_BASE                   I3C2_BASE_NS

#define I3C3                        I3C3_NS
#define I3C3_BASE                   I3C3_BASE_NS

#define TIM10                       TIM10_NS
#define TIM10_BASE                  TIM10_BASE_NS

#define TIM11                       TIM11_NS
#define TIM11_BASE                  TIM11_BASE_NS

/*!< APB2 peripherals defaults to Non secure aliases */
#define TIM1                        TIM1_NS
#define TIM1_BASE                   TIM1_BASE_NS

#define TIM8                        TIM8_NS
#define TIM8_BASE                   TIM8_BASE_NS

#define USART6                      USART6_NS
#define USART6_BASE                 USART6_BASE_NS

#define SPI1                        SPI1_NS
#define SPI1_BASE                   SPI1_BASE_NS

