STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213dxx_cm33.h
/* Bit fields for PWR_CR8 register */
#define PWR_CR8_VDDIO1VMEN_Pos                 (0U)
#define PWR_CR8_VDDIO1VMEN_Msk                 (0x1UL << PWR_CR8_VDDIO1VMEN_Pos)
#define PWR_CR8_VDDIO1VMEN                     PWR_CR8_VDDIO1VMEN_Msk
#define PWR_CR8_VDDIO1SV_Pos                   (8U)
#define PWR_CR8_VDDIO1SV_Msk                   (0x1UL << PWR_CR8_VDDIO1SV_Pos)
#define PWR_CR8_VDDIO1SV                       PWR_CR8_VDDIO1SV_Msk
#define PWR_CR8_VDDIO1RDY_Pos                  (16U)
#define PWR_CR8_VDDIO1RDY_Msk                  (0x1UL << PWR_CR8_VDDIO1RDY_Pos)
#define PWR_CR8_VDDIO1RDY                      PWR_CR8_VDDIO1RDY_Msk
#define PWR_CR8_VDDIO1VRSEL_Pos                (24U)
#define PWR_CR8_VDDIO1VRSEL_Msk                (0x1UL << PWR_CR8_VDDIO1VRSEL_Pos)
#define PWR_CR8_VDDIO1VRSEL                    PWR_CR8_VDDIO1VRSEL_Msk
#define PWR_CR8_VDDIO1VRSTBY_Pos               (25U)
#define PWR_CR8_VDDIO1VRSTBY_Msk               (0x1UL << PWR_CR8_VDDIO1VRSTBY_Pos)
#define PWR_CR8_VDDIO1VRSTBY                   PWR_CR8_VDDIO1VRSTBY_Msk

/* Bit fields for PWR_CR9 register */
#define PWR_CR9_BKPRBSEN_Pos                   (0U)
#define PWR_CR9_BKPRBSEN_Msk                   (0x1UL << PWR_CR9_BKPRBSEN_Pos)
#define PWR_CR9_BKPRBSEN                       PWR_CR9_BKPRBSEN_Msk  /*!< Backup RAM backup supply enable (used to maintain BKP RAM content in Standby and VBAT modes).When set, the backup ram is supplied from backup regulator in Standby and VBAT modes.When reset, The backup ram can still be used in Run and Stop modes but its content will be lost in Standby and VBAT modes.- 0: BKPSRAM Backup supply disable.- 1: BKPSRAM Backup supply enable. */

/* Bit fields for PWR_CR10 register */
#define PWR_CR10_RETRBSEN_Pos                  (0U)
#define PWR_CR10_RETRBSEN_Msk                  (0x3UL << PWR_CR10_RETRBSEN_Pos)
#define PWR_CR10_RETRBSEN                      PWR_CR10_RETRBSEN_Msk  /*!< Retention RAM backup supply enable (used to maintain RET RAM content in Standby and VBAT modes).When set, the retention ram is supplied from backup regulator in Standby and VBAT modes. When reset, the retention ram can still be used in Run and Stop modes but its content will be lost in Standby and VBAT modes.- 00: RETRAM Backup supply disable.- 01: RETRAM Backup supply enable in Standby and VBAT modes.- 10: RETRAM Backup supply enable only in Standby mode (memory content lost in VBAT mode).- 11: RETRAM Backup supply enable only in Standby mode (memory content lost in VBAT mode). */

/* Bit fields for PWR_CR11 register */
#define PWR_CR11_DDRRETDIS_Pos                 (0U)
#define PWR_CR11_DDRRETDIS_Msk                 (0x1UL << PWR_CR11_DDRRETDIS_Pos)
#define PWR_CR11_DDRRETDIS                     PWR_CR11_DDRRETDIS_Msk





/* Bit fields for PWR_BDCR register */
#define PWR_BDCR_DBP_Pos                    (0U)
#define PWR_BDCR_DBP_Msk                    (0x1UL << PWR_BDCR_DBP_Pos)
#define PWR_BDCR_DBP                        PWR_BDCR_DBP_Msk  /*!< Disable backup domains write protection.In reset state, all registers in backup domains is protected against parasitic write access from D1 and D2 domains. This bit must be set to enable write access to these registers.- 0: Write access to backup domains disabled- 1: Write access to backup domains enabled */


/* Bit fields for PWR_CPU1CR register */
#define PWR_CPU1CR_PDDS_D2_Pos                 (0U)
#define PWR_CPU1CR_PDDS_D2_Msk                 (0x1UL << PWR_CPU1CR_PDDS_D2_Pos)
#define PWR_CPU1CR_PDDS_D2                     PWR_CPU1CR_PDDS_D2_Msk  /*!< D2 Domain / System Power Down Deepsleep selection.This bit is reset only by a VDD POR reset. (not reset when exit from Standby mode)Allows CPU1 to define the Deepsleep mode for the D2 / system.- 0: Keep Stop mode when CPU1 enters to CStop.- 1: Allow Standby mode when CPU1 enters to CStop. */
#define PWR_CPU1CR_PDDS_D1_Pos                 (1U)
#define PWR_CPU1CR_PDDS_D1_Msk                 (0x1UL << PWR_CPU1CR_PDDS_D1_Pos)
#define PWR_CPU1CR_PDDS_D1                     PWR_CPU1CR_PDDS_D1_Msk  /*!< D1 domain Power Down Deepsleep selection.This bit is reset only by a VDD POR reset. (not reset when exit from Standby mode)Allows CPU1 to define the Deepsleep mode for the system.- 0: Keep DStop mode when CPU1 enters to CStop.- 1: Allow DStandby mode when CPU1 enters to CStop. */
#define PWR_CPU1CR_VBF_Pos                     (4U)
#define PWR_CPU1CR_VBF_Msk                     (0x1UL << PWR_CPU1CR_VBF_Pos)
#define PWR_CPU1CR_VBF                         PWR_CPU1CR_VBF_Msk  /*!< VBAT exit FlagThis bit is set by hardware and cleared only by a Vsw POR reset or by setting the CPU1 CSSF bit. (not reset when exit from VBAT)- 0: System has not been in VBAT mode.- 1: System has been in VBAT mode. */
#define PWR_CPU1CR_STOPF_Pos                   (5U)
#define PWR_CPU1CR_STOPF_Msk                   (0x1UL << PWR_CPU1CR_STOPF_Pos)
#define PWR_CPU1CR_STOPF                       PWR_CPU1CR_STOPF_Msk  /*!< System Stop FlagThis bit is set by hardware and cleared only by any system reset or by setting the CPU1 CSSF bit.- 0: System has not been in Stop mode.- 1: System has been in Stop mode, clock system has been stopped. */
#define PWR_CPU1CR_SBF_Pos                     (6U)
#define PWR_CPU1CR_SBF_Msk                     (0x1UL << PWR_CPU1CR_SBF_Pos)
#define PWR_CPU1CR_SBF                         PWR_CPU1CR_SBF_Msk  /*!< System Standby FlagThis bit is set by hardware and cleared only by a VDD POR reset or by setting the CPU1 and CPU2 CSSF bit. (not reset when exit from Standby mode)- 0: System has not been in Standby mode.- 1: System has been in Standby mode, system contents has been lost. */
#define PWR_CPU1CR_SBF_D1_Pos                  (7U)
#define PWR_CPU1CR_SBF_D1_Msk                  (0x1UL << PWR_CPU1CR_SBF_D1_Pos)
#define PWR_CPU1CR_SBF_D1                      PWR_CPU1CR_SBF_D1_Msk  /*!< D1 DStandby FlagThis bit is set by hardware and cleared only by a VDD POR reset or by setting the CPU1 CSSF bit. (not reset when exit from Standby mode)- 0: D1 domain has not been in DStandby mode.- 1: D1 domain has been in DStandby mode. */
#define PWR_CPU1CR_CSSF_Pos                    (9U)
#define PWR_CPU1CR_CSSF_Msk                    (0x1UL << PWR_CPU1CR_CSSF_Pos)
#define PWR_CPU1CR_CSSF                        PWR_CPU1CR_CSSF_Msk  /*!< Clear CPU1 STOPF, SBF_D1/_D3, SBF, VBF flags and CPU2 SBF flag.(Always read as 0)This bit is reset on any system reset.- 0: No effect.- 1: When written, clear the CPU1 flags (STOPF, SBF_D1/_D3, SBF, and VBF) and CPU2 SBF flag. Register bit is cleared to 0 by hardware. */
#define PWR_CPU1CR_STANDBYWFIL2_Pos            (15U)
#define PWR_CPU1CR_STANDBYWFIL2_Msk            (0x1UL << PWR_CPU1CR_STANDBYWFIL2_Pos)
#define PWR_CPU1CR_STANDBYWFIL2                PWR_CPU1CR_STANDBYWFIL2_Msk  /*!< CPU1 system idle indication.This bit is set and reset by HW based on the CPU1 operation mode.- 0: CPU1 system active.- 1: CPU1 system idle. */
#define PWR_CPU1CR_LPDS_D1_Pos                 (16U)
#define PWR_CPU1CR_LPDS_D1_Msk                 (0x1UL << PWR_CPU1CR_LPDS_D1_Pos)
#define PWR_CPU1CR_LPDS_D1                     PWR_CPU1CR_LPDS_D1_Msk  /*!< Low power Deepsleep Stop mode selection for the D1 domain (DStop2).This bit is reset on any system reset.- 0: Stop mode selected, external regulator kept in main power mode.- 1: low-power stop mode selected, external regulator may enter low power mode. Further low power mode selection is provided by LVDS_D1. */
#define PWR_CPU1CR_LVDS_D1_Pos                 (17U)
#define PWR_CPU1CR_LVDS_D1_Msk                 (0x1UL << PWR_CPU1CR_LVDS_D1_Pos)
#define PWR_CPU1CR_LVDS_D1                     PWR_CPU1CR_LVDS_D1_Msk  /*!< Low voltage Deepsleep LPLV-Stop mode selection for the D1 domain (DStop3).This bit is reset on any system reset.This bit has only effect when the low power stop mode is selected in LPDS_D1 and will change the VDDCPU domain supply reset level.- 0: LP-Stop mode VDDCPU domain supply reset level at same level as Run mode. The VDDCPU domain supply level in LP-Stop mode shall be kept at same level as Run mode.- 1: LPLV-Stop mode VDDCPU domain supply reset level at lower level than Run mode. Allows to lower VDDCPU domain supply in LPLV-Stop mode (see datasheet for voltage levels). */

/* Bit fields for PWR_CPU2CR register */
#define PWR_CPU2CR_PDDS_D2_Pos                 (0U)
#define PWR_CPU2CR_PDDS_D2_Msk                 (0x1UL << PWR_CPU2CR_PDDS_D2_Pos)
#define PWR_CPU2CR_PDDS_D2                     PWR_CPU2CR_PDDS_D2_Msk  /*!< D2 Domain / System Power Down Deepsleep selection.This bit is reset only by a VDD POR reset. (not reset when exit from Standby mode)Allows CPU2 to define the Deepsleep mode for the system / D2.- 0: Keep Stop mode when CPU2 enters to CStop.- 1: Allow Standby mode when CPU2 enters to CStop. */
#define PWR_CPU2CR_VBF_Pos                     (4U)
#define PWR_CPU2CR_VBF_Msk                     (0x1UL << PWR_CPU2CR_VBF_Pos)
#define PWR_CPU2CR_VBF                         PWR_CPU2CR_VBF_Msk  /*!< VBAT exit FlagThis bit is set by hardware and cleared only by a Vsw POR reset or by setting the CPU1 CSSF bit. (not reset when exit from VBAT)- 0: System has not been in VBAT mode.- 1: System has been in VBAT mode. */
#define PWR_CPU2CR_STOPF_Pos                   (5U)
#define PWR_CPU2CR_STOPF_Msk                   (0x1UL << PWR_CPU2CR_STOPF_Pos)
#define PWR_CPU2CR_STOPF                       PWR_CPU2CR_STOPF_Msk  /*!< System Stop FlagThis bit is set by hardware and cleared only by any system reset or by setting the CPU2 CSSF bit.- 0: System has not been in Stop mode.- 1: System has been in Stop mode, clock system has been stopped. */
#define PWR_CPU2CR_SBF_Pos                     (6U)
#define PWR_CPU2CR_SBF_Msk                     (0x1UL << PWR_CPU2CR_SBF_Pos)
#define PWR_CPU2CR_SBF                         PWR_CPU2CR_SBF_Msk  /*!< System Standby FlagThis bit is set by hardware and cleared only by a VDD POR reset or by setting the CPU2 and CPU1 CSSF bit. (not reset when exit from Standby mode)- 0: System has not been in Standby mode- 1: System has been in Standby mode, system contents has been lost. */
#define PWR_CPU2CR_SBF_D2_Pos                  (7U)
#define PWR_CPU2CR_SBF_D2_Msk                  (0x1UL << PWR_CPU2CR_SBF_D2_Pos)
#define PWR_CPU2CR_SBF_D2                      PWR_CPU2CR_SBF_D2_Msk  /*!< D2 Standby FlagThis bit is set by hardware and cleared only by a VDD POR reset or by setting the CPU2 CSSF bit. (not reset when exit from Standby mode)- 0: D2 domain has not been in Standby mode.- 1: D2 domain has been in Standby mode. */
#define PWR_CPU2CR_CSSF_Pos                    (9U)
#define PWR_CPU2CR_CSSF_Msk                    (0x1UL << PWR_CPU2CR_CSSF_Pos)
#define PWR_CPU2CR_CSSF                        PWR_CPU2CR_CSSF_Msk  /*!< Clear CPU2 STOPF, SBF_D2, SBF_D3, SBF, VBF flags and CPU1 SBF flag.(Always read as 0)This bit is reset on any system reset.- 0: No effect.- 1: When written, clear the CPU2 flags (STOPF, SBF_D2, SBF_D3, SBF and VBF) and CPU1 SBF flag. Register bit is cleared to 0 by hardware. */
#define PWR_CPU2CR_DEEPSLEEP_Pos               (15U)
#define PWR_CPU2CR_DEEPSLEEP_Msk               (0x1UL << PWR_CPU2CR_DEEPSLEEP_Pos)
#define PWR_CPU2CR_DEEPSLEEP                   PWR_CPU2CR_DEEPSLEEP_Msk  /*!< CPU2 system idle indication.This bit is set and reset by HW based on the CPU2 operation mode.- 0: CPU2 system active.- 1: CPU2 system idle. */
#define PWR_CPU2CR_LPDS_D2_Pos                 (16U)
#define PWR_CPU2CR_LPDS_D2_Msk                 (0x1UL << PWR_CPU2CR_LPDS_D2_Pos)
#define PWR_CPU2CR_LPDS_D2                     PWR_CPU2CR_LPDS_D2_Msk  /*!< Low power Deepsleep Stop mode selection for the D2 domain / System.This bit is reset on any system reset.- 0: Stop mode selected, external regulator kept in main power mode (pwr_lp=1)- 1: low-power stop mode selected, external regulator may enter low power mode (pwr_lp =0). Further low power mode selection is provided by LVDS_D2. */
#define PWR_CPU2CR_LVDS_D2_Pos                 (17U)
#define PWR_CPU2CR_LVDS_D2_Msk                 (0x1UL << PWR_CPU2CR_LVDS_D2_Pos)
#define PWR_CPU2CR_LVDS_D2                     PWR_CPU2CR_LVDS_D2_Msk  /*!< Low voltage Deepsleep LPLV-Stop mode selection for the D2 domain / System.This bit is reset on any system reset.This bit has only effect when the low power stop mode is selected in LPDS_D2 and will change the VDDCORE domain supply reset level.- 0: LP-Stop mode VDDCORE domain supply reset level at same level as Run mode. The VDDCORE domain supply level in LP-Stop mode shall be kept at same level as Run mode.- 1: LPLV-Stop mode VDDCORE domain supply reset level at lower level than Run mode. Allows to lower VDDCORE domain supply in LPLV-Stop mode (see datasheet for voltage levels). */


