STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213dxx_cm33.h
#define USBH_EHCI_INSNREG03_EN_CLK256_CHECK_Pos     (14U)
#define USBH_EHCI_INSNREG03_EN_CLK256_CHECK_Msk     (0x1U << USBH_EHCI_INSNREG03_EN_CLK256_CHECK_Pos)          /*!< 0x00004000 */
#define USBH_EHCI_INSNREG03_EN_CLK256_CHECK         USBH_EHCI_INSNREG03_EN_CLK256_CHECK_Msk                    /*!< Enable 256 clock checking */

#define USBH_EHCI_INSNREG03_ENABLE_LS_GLITCH_Pos    (16U)
#define USBH_EHCI_INSNREG03_ENABLE_LS_GLITCH_Msk    (0x1U << USBH_EHCI_INSNREG03_ENABLE_LS_GLITCH_Pos)         /*!< 0x00010000 */
#define USBH_EHCI_INSNREG03_ENABLE_LS_GLITCH        USBH_EHCI_INSNREG03_ENABLE_LS_GLITCH_Msk                   /*!< Enable/disable enhancement for line state glitch */

/********************  Bit definition for USBH_EHCI_INSNREG04 register  **********************/
#define USBH_EHCI_INSNREG04_HCSPARAMS_WRT_Pos       (0U)
#define USBH_EHCI_INSNREG04_HCSPARAMS_WRT_Msk       (0x1U << USBH_EHCI_INSNREG04_HCSPARAMS_WRT_Pos)            /*!< 0x00000001 */
#define USBH_EHCI_INSNREG04_HCSPARAMS_WRT           USBH_EHCI_INSNREG04_HCSPARAMS_WRT_Msk                      /*!< Bit 0 */

#define USBH_EHCI_INSNREG04_HCCPARAMS_WRT_Pos       (1U)
#define USBH_EHCI_INSNREG04_HCCPARAMS_WRT_Msk       (0x1U << USBH_EHCI_INSNREG04_HCCPARAMS_WRT_Pos)            /*!< 0x00000002 */
#define USBH_EHCI_INSNREG04_HCCPARAMS_WRT           USBH_EHCI_INSNREG04_HCCPARAMS_WRT_Msk                      /*!< When this bit is 1, the USBH_EHCI_HCSPARAMS register becomes writable */

#define USBH_EHCI_INSNREG04_ASYNC_PIPELINE_DIS_Pos  (3U)
#define USBH_EHCI_INSNREG04_ASYNC_PIPELINE_DIS_Msk  (0x1U << USBH_EHCI_INSNREG04_ASYNC_PIPELINE_DIS_Pos)       /*!< 0x00000008 */
#define USBH_EHCI_INSNREG04_ASYNC_PIPELINE_DIS      USBH_EHCI_INSNREG04_ASYNC_PIPELINE_DIS_Msk                 /*!< When this bit is 1, the USBH_EHCI_HCCPARAMS register bits 17, 15:4, and 2:0 become writable */

#define USBH_EHCI_INSNREG04_SUSPEND_SIGNAL_Pos      (5U)
#define USBH_EHCI_INSNREG04_SUSPEND_SIGNAL_Msk      (0x1U << USBH_EHCI_INSNREG04_SUSPEND_SIGNAL_Pos)           /*!< 0x00000020 */
#define USBH_EHCI_INSNREG04_SUSPEND_SIGNAL          USBH_EHCI_INSNREG04_SUSPEND_SIGNAL_Msk                     /*!< Suspend signal */

/********************  Bit definition for USBH_EHCI_INSNREG05 register  **********************/
#define USBH_EHCI_INSNREG05_VSTATUS_Pos             (0U)
#define USBH_EHCI_INSNREG05_VSTATUS_Msk             (0xFFU << USBH_EHCI_INSNREG05_VSTATUS_Pos)                 /*!< 0x000000FF */
#define USBH_EHCI_INSNREG05_VSTATUS                 USBH_EHCI_INSNREG05_VSTATUS_Msk                            /*!< UTMI VStatus (vendor status) */

#define USBH_EHCI_INSNREG05_VCONTROL_Pos            (8U)
#define USBH_EHCI_INSNREG05_VCONTROL_Msk            (0xFU << USBH_EHCI_INSNREG05_VCONTROL_Pos)                 /*!< 0x00000F00 */
#define USBH_EHCI_INSNREG05_VCONTROL                USBH_EHCI_INSNREG05_VCONTROL_Msk                           /*!< UTMI VCONTROL (vendor control) */

#define USBH_EHCI_INSNREG05_VCONTROL_LDM_Pos        (12U)
#define USBH_EHCI_INSNREG05_VCONTROL_LDM_Msk        (0x1U << USBH_EHCI_INSNREG05_VCONTROL_LDM_Pos)             /*!< 0x00001000 */
#define USBH_EHCI_INSNREG05_VCONTROL_LDM            USBH_EHCI_INSNREG05_VCONTROL_LDM_Msk                       /*!< UTMI VCONTROLLoad (vendor control load) */

#define USBH_EHCI_INSNREG05_VPORT_Pos               (13U)
#define USBH_EHCI_INSNREG05_VPORT_Msk               (0xFU << USBH_EHCI_INSNREG05_VPORT_Pos)                    /*!< 0x0001E000 */
#define USBH_EHCI_INSNREG05_VPORT                   USBH_EHCI_INSNREG05_VPORT_Msk                              /*!< UTMI VPORT */

#define USBH_EHCI_INSNREG05_VBUSY_Pos               (17U)
#define USBH_EHCI_INSNREG05_VBUSY_Msk               (0x1U << USBH_EHCI_INSNREG05_VBUSY_Pos)                    /*!< 0x00020000 */
#define USBH_EHCI_INSNREG05_VBUSY                   USBH_EHCI_INSNREG05_VBUSY_Msk                              /*!< UTMI VBUSY */

/********************  Bit definition for USBH_EHCI_INSNREG06 register  **********************/
#define USBH_EHCI_INSNREG06_SUC_BEATS_Pos           (0U)
#define USBH_EHCI_INSNREG06_SUC_BEATS_Msk           (0xFU << USBH_EHCI_INSNREG06_SUC_BEATS_Pos)                /*!< 0x0000000F */
#define USBH_EHCI_INSNREG06_SUC_BEATS               USBH_EHCI_INSNREG06_SUC_BEATS_Msk                          /*!< Number of successful beats */

#define USBH_EHCI_INSNREG06_EXP_BEATS_Pos           (4U)
#define USBH_EHCI_INSNREG06_EXP_BEATS_Msk           (0x1FU << USBH_EHCI_INSNREG06_EXP_BEATS_Pos)               /*!< 0x000001F0 */
#define USBH_EHCI_INSNREG06_EXP_BEATS               USBH_EHCI_INSNREG06_EXP_BEATS_Msk                          /*!< Number of expected beats */

#define USBH_EHCI_INSNREG06_HBURST_Pos              (9U)
#define USBH_EHCI_INSNREG06_HBURST_Msk              (0x7U << USBH_EHCI_INSNREG06_HBURST_Pos)                   /*!< 0x00000E00 */
#define USBH_EHCI_INSNREG06_HBURST                  USBH_EHCI_INSNREG06_HBURST_Msk                             /*!< HBURST value of the control phase at which the AHB error occurred */

#define USBH_EHCI_INSNREG06_AHB_ECAP_Pos            (31U)
#define USBH_EHCI_INSNREG06_AHB_ECAP_Msk            (0x1U << USBH_EHCI_INSNREG06_AHB_ECAP_Pos)                 /*!< 0x80000000 */
#define USBH_EHCI_INSNREG06_AHB_ECAP                USBH_EHCI_INSNREG06_AHB_ECAP_Msk                           /*!< AHB error captured */

/********************  Bit definition for USBH_EHCI_INSNREG07 register  **********************/
#define USBH_EHCI_INSNREG07_AHB_MST_ERR_Pos          (0U)
#define USBH_EHCI_INSNREG07_AHB_MST_ERR_Msk          (0xFFFFFFFFU << USBH_EHCI_INSNREG07_AHB_MST_ERR_Pos)      /*!< 0xFFFFFFFF */
#define USBH_EHCI_INSNREG07_AHB_MST_ERR              USBH_EHCI_INSNREG07_AHB_MST_ERR_Msk                       /*!< AHB master error address */


/******************************************************************************/
/*                                                                            */
/*                                       USB_OTG                              */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for USB_OTG_GOTGCTL register  ********************/
#define USB_OTG_GOTGCTL_SRQSCS_Pos               (0U)
#define USB_OTG_GOTGCTL_SRQSCS_Msk               (0x1UL << USB_OTG_GOTGCTL_SRQSCS_Pos)      /*!< 0x00000001 */
#define USB_OTG_GOTGCTL_SRQSCS                   USB_OTG_GOTGCTL_SRQSCS_Msk                /*!< Session request success */
#define USB_OTG_GOTGCTL_SRQ_Pos                  (1U)
#define USB_OTG_GOTGCTL_SRQ_Msk                  (0x1UL << USB_OTG_GOTGCTL_SRQ_Pos)         /*!< 0x00000002 */
#define USB_OTG_GOTGCTL_SRQ                      USB_OTG_GOTGCTL_SRQ_Msk                   /*!< Session request */
#define USB_OTG_GOTGCTL_VBVALOEN_Pos             (2U)
#define USB_OTG_GOTGCTL_VBVALOEN_Msk             (0x1UL << USB_OTG_GOTGCTL_VBVALOEN_Pos)    /*!< 0x00000004 */
#define USB_OTG_GOTGCTL_VBVALOEN                 USB_OTG_GOTGCTL_VBVALOEN_Msk              /*!< VBUS valid override enable */
#define USB_OTG_GOTGCTL_VBVALOVAL_Pos            (3U)
#define USB_OTG_GOTGCTL_VBVALOVAL_Msk            (0x1UL << USB_OTG_GOTGCTL_VBVALOVAL_Pos)   /*!< 0x00000008 */
#define USB_OTG_GOTGCTL_VBVALOVAL                USB_OTG_GOTGCTL_VBVALOVAL_Msk             /*!< VBUS valid override value */
#define USB_OTG_GOTGCTL_AVALOEN_Pos              (4U)
#define USB_OTG_GOTGCTL_AVALOEN_Msk              (0x1UL << USB_OTG_GOTGCTL_AVALOEN_Pos)     /*!< 0x00000010 */
#define USB_OTG_GOTGCTL_AVALOEN                  USB_OTG_GOTGCTL_AVALOEN_Msk               /*!< A-peripheral session valid override enable */
#define USB_OTG_GOTGCTL_AVALOVAL_Pos             (5U)
#define USB_OTG_GOTGCTL_AVALOVAL_Msk             (0x1UL << USB_OTG_GOTGCTL_AVALOVAL_Pos)    /*!< 0x00000020 */
#define USB_OTG_GOTGCTL_AVALOVAL                 USB_OTG_GOTGCTL_AVALOVAL_Msk              /*!< A-peripheral session valid override value */
#define USB_OTG_GOTGCTL_BVALOEN_Pos              (6U)
#define USB_OTG_GOTGCTL_BVALOEN_Msk              (0x1UL << USB_OTG_GOTGCTL_BVALOEN_Pos)     /*!< 0x00000040 */
#define USB_OTG_GOTGCTL_BVALOEN                  USB_OTG_GOTGCTL_BVALOEN_Msk               /*!< B-peripheral session valid override enable */
#define USB_OTG_GOTGCTL_BVALOVAL_Pos             (7U)
#define USB_OTG_GOTGCTL_BVALOVAL_Msk             (0x1UL << USB_OTG_GOTGCTL_BVALOVAL_Pos)    /*!< 0x00000080 */
#define USB_OTG_GOTGCTL_BVALOVAL                 USB_OTG_GOTGCTL_BVALOVAL_Msk              /*!< B-peripheral session valid override value  */
#define USB_OTG_GOTGCTL_BSESVLD_Pos              (19U)
#define USB_OTG_GOTGCTL_BSESVLD_Msk              (0x1UL << USB_OTG_GOTGCTL_BSESVLD_Pos)     /*!< 0x00080000 */
#define USB_OTG_GOTGCTL_BSESVLD                  USB_OTG_GOTGCTL_BSESVLD_Msk               /*!<  B-session valid*/

/********************  Bit definition for USB_OTG_HCFG register  ********************/
#define USB_OTG_HCFG_FSLSPCS_Pos                 (0U)
#define USB_OTG_HCFG_FSLSPCS_Msk                 (0x3UL << USB_OTG_HCFG_FSLSPCS_Pos)        /*!< 0x00000003 */
#define USB_OTG_HCFG_FSLSPCS                     USB_OTG_HCFG_FSLSPCS_Msk                  /*!< FS/LS PHY clock select */
#define USB_OTG_HCFG_FSLSPCS_0                   (0x1UL << USB_OTG_HCFG_FSLSPCS_Pos)        /*!< 0x00000001 */
#define USB_OTG_HCFG_FSLSPCS_1                   (0x2UL << USB_OTG_HCFG_FSLSPCS_Pos)        /*!< 0x00000002 */
#define USB_OTG_HCFG_FSLSS_Pos                   (2U)
#define USB_OTG_HCFG_FSLSS_Msk                   (0x1UL << USB_OTG_HCFG_FSLSS_Pos)          /*!< 0x00000004 */
#define USB_OTG_HCFG_FSLSS                       USB_OTG_HCFG_FSLSS_Msk                    /*!< FS- and LS-only support */

/********************  Bit definition for USB_OTG_DCFG register  ********************/
#define USB_OTG_DCFG_DSPD_Pos                    (0U)
#define USB_OTG_DCFG_DSPD_Msk                    (0x3UL << USB_OTG_DCFG_DSPD_Pos)           /*!< 0x00000003 */
#define USB_OTG_DCFG_DSPD                        USB_OTG_DCFG_DSPD_Msk                     /*!< Device speed */
#define USB_OTG_DCFG_DSPD_0                      (0x1UL << USB_OTG_DCFG_DSPD_Pos)           /*!< 0x00000001 */
#define USB_OTG_DCFG_DSPD_1                      (0x2UL << USB_OTG_DCFG_DSPD_Pos)           /*!< 0x00000002 */
#define USB_OTG_DCFG_NZLSOHSK_Pos                (2U)
#define USB_OTG_DCFG_NZLSOHSK_Msk                (0x1UL << USB_OTG_DCFG_NZLSOHSK_Pos)       /*!< 0x00000004 */
#define USB_OTG_DCFG_NZLSOHSK                    USB_OTG_DCFG_NZLSOHSK_Msk                 /*!< Nonzero-length status OUT handshake */
#define USB_OTG_DCFG_DAD_Pos                     (4U)
#define USB_OTG_DCFG_DAD_Msk                     (0x7FUL << USB_OTG_DCFG_DAD_Pos)           /*!< 0x000007F0 */
#define USB_OTG_DCFG_DAD                         USB_OTG_DCFG_DAD_Msk                      /*!< Device address */
#define USB_OTG_DCFG_DAD_0                       (0x01UL << USB_OTG_DCFG_DAD_Pos)           /*!< 0x00000010 */
#define USB_OTG_DCFG_DAD_1                       (0x02UL << USB_OTG_DCFG_DAD_Pos)           /*!< 0x00000020 */
#define USB_OTG_DCFG_DAD_2                       (0x04UL << USB_OTG_DCFG_DAD_Pos)           /*!< 0x00000040 */
#define USB_OTG_DCFG_DAD_3                       (0x08UL << USB_OTG_DCFG_DAD_Pos)           /*!< 0x00000080 */
#define USB_OTG_DCFG_DAD_4                       (0x10UL << USB_OTG_DCFG_DAD_Pos)           /*!< 0x00000100 */
#define USB_OTG_DCFG_DAD_5                       (0x20UL << USB_OTG_DCFG_DAD_Pos)           /*!< 0x00000200 */
#define USB_OTG_DCFG_DAD_6                       (0x40UL << USB_OTG_DCFG_DAD_Pos)           /*!< 0x00000400 */
#define USB_OTG_DCFG_PFIVL_Pos                   (11U)
#define USB_OTG_DCFG_PFIVL_Msk                   (0x3UL << USB_OTG_DCFG_PFIVL_Pos)          /*!< 0x00001800 */
#define USB_OTG_DCFG_PFIVL                       USB_OTG_DCFG_PFIVL_Msk                    /*!< Periodic (micro)frame interval */
#define USB_OTG_DCFG_PFIVL_0                     (0x1UL << USB_OTG_DCFG_PFIVL_Pos)          /*!< 0x00000800 */
#define USB_OTG_DCFG_PFIVL_1                     (0x2UL << USB_OTG_DCFG_PFIVL_Pos)          /*!< 0x00001000 */
#define USB_OTG_DCFG_PERSCHIVL_Pos               (24U)
#define USB_OTG_DCFG_PERSCHIVL_Msk               (0x3UL << USB_OTG_DCFG_PERSCHIVL_Pos)      /*!< 0x03000000 */
#define USB_OTG_DCFG_PERSCHIVL                   USB_OTG_DCFG_PERSCHIVL_Msk                /*!< Periodic scheduling interval */
#define USB_OTG_DCFG_PERSCHIVL_0                 (0x1UL << USB_OTG_DCFG_PERSCHIVL_Pos)      /*!< 0x01000000 */
#define USB_OTG_DCFG_PERSCHIVL_1                 (0x2UL << USB_OTG_DCFG_PERSCHIVL_Pos)      /*!< 0x02000000 */

/********************  Bit definition for USB_OTG_PCGCR register  ********************/
#define USB_OTG_PCGCR_STPPCLK_Pos                (0U)
#define USB_OTG_PCGCR_STPPCLK_Msk                (0x1UL << USB_OTG_PCGCR_STPPCLK_Pos)       /*!< 0x00000001 */
#define USB_OTG_PCGCR_STPPCLK                    USB_OTG_PCGCR_STPPCLK_Msk                 /*!< Stop PHY clock */
#define USB_OTG_PCGCR_GATEHCLK_Pos               (1U)
#define USB_OTG_PCGCR_GATEHCLK_Msk               (0x1UL << USB_OTG_PCGCR_GATEHCLK_Pos)      /*!< 0x00000002 */
#define USB_OTG_PCGCR_GATEHCLK                   USB_OTG_PCGCR_GATEHCLK_Msk                /*!< Gate HCLK */
#define USB_OTG_PCGCR_PHYSUSP_Pos                (4U)
#define USB_OTG_PCGCR_PHYSUSP_Msk                (0x1UL << USB_OTG_PCGCR_PHYSUSP_Pos)       /*!< 0x00000010 */
#define USB_OTG_PCGCR_PHYSUSP                    USB_OTG_PCGCR_PHYSUSP_Msk                 /*!< PHY suspended */

