STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp213dxx_cm33.h
/******************************* IWDG Instances *******************************/
#define IS_IWDG_ALL_INSTANCE(INSTANCE) (((INSTANCE) == IWDG1_S) || ((INSTANCE) == IWDG1_NS) || \
                                        ((INSTANCE) == IWDG2_S) || ((INSTANCE) == IWDG2_NS) || \
                                        ((INSTANCE) == IWDG3_S) || ((INSTANCE) == IWDG3_NS) || \
                                        ((INSTANCE) == IWDG4_S) || ((INSTANCE) == IWDG4_NS))
/******************************* LPTIM Instances ******************************/
#define IS_LPTIM_INSTANCE(INSTANCE) (((INSTANCE) == LPTIM1_S) || ((INSTANCE) == LPTIM1_NS) || \
                                     ((INSTANCE) == LPTIM2_S) || ((INSTANCE) == LPTIM2_NS) || \
                                     ((INSTANCE) == LPTIM3_S) || ((INSTANCE) == LPTIM3_NS) || \
                                     ((INSTANCE) == LPTIM4_S) || ((INSTANCE) == LPTIM4_NS) || \
                                     ((INSTANCE) == LPTIM5_S) || ((INSTANCE) == LPTIM5_NS))

/****************** LPTIM Instances : DMA supported instances *****************/
#define IS_LPTIM_DMA_INSTANCE(INSTANCE)  (((INSTANCE) == LPTIM1_NS) || ((INSTANCE) == LPTIM1_S) || \
                                          ((INSTANCE) == LPTIM2_NS) || ((INSTANCE) == LPTIM2_S) || \
                                          ((INSTANCE) == LPTIM3_NS) || ((INSTANCE) == LPTIM3_S) || \
                                          ((INSTANCE) == LPTIM4_NS) || ((INSTANCE) == LPTIM4_S))

/************* LPTIM Instances : at least 1 capture/compare channel ***********/
#define IS_LPTIM_CC1_INSTANCE(INSTANCE) (((INSTANCE) == LPTIM1_NS)  || ((INSTANCE) == LPTIM1_S) || \
                                         ((INSTANCE) == LPTIM2_NS)  || ((INSTANCE) == LPTIM2_S) || \
                                         ((INSTANCE) == LPTIM3_NS)  || ((INSTANCE) == LPTIM3_S) || \
                                         ((INSTANCE) == LPTIM4_NS)  || ((INSTANCE) == LPTIM4_S) || \
                                         ((INSTANCE) == LPTIM5_NS)  || ((INSTANCE) == LPTIM5_S))

/************* LPTIM Instances : at least 2 capture/compare channel ***********/
#define IS_LPTIM_CC2_INSTANCE(INSTANCE) (((INSTANCE) == LPTIM1_NS) || ((INSTANCE) == LPTIM1_S) || \
                                         ((INSTANCE) == LPTIM2_NS) || ((INSTANCE) == LPTIM2_S) || \
                                         ((INSTANCE) == LPTIM3_NS) || ((INSTANCE) == LPTIM3_S) || \
                                         ((INSTANCE) == LPTIM4_NS) || ((INSTANCE) == LPTIM4_S))

/****************** LPTIM Instances : supporting encoder interface **************/
#define IS_LPTIM_ENCODER_INTERFACE_INSTANCE(INSTANCE)  (((INSTANCE) == LPTIM1_NS) || ((INSTANCE) == LPTIM1_S) || \
                                                        ((INSTANCE) == LPTIM2_NS) || ((INSTANCE) == LPTIM2_S))

/****************** LPTIM Instances : supporting Input Capture **************/
#define IS_LPTIM_INPUT_CAPTURE_INSTANCE(INSTANCE)  (((INSTANCE) == LPTIM1_NS) || ((INSTANCE) == LPTIM1_S) || \
                                                    ((INSTANCE) == LPTIM2_NS) || ((INSTANCE) == LPTIM2_S) || \
                                                    ((INSTANCE) == LPTIM3_NS) || ((INSTANCE) == LPTIM3_S) || \
                                                    ((INSTANCE) == LPTIM4_NS) || ((INSTANCE) == LPTIM4_S))

/******************************* LTDC Instances *******************************/
#define IS_LTDC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == LTDC_S) || ((INSTANCE) == LTDC_NS))

/******************************* MDF/ADF Instances ****************************/
#define IS_MDF_ALL_INSTANCE(INSTANCE) (((INSTANCE) == MDF1_Filter0_NS)  || ((INSTANCE) == MDF1_Filter0_S) || \
                                       ((INSTANCE) == MDF1_Filter1_NS)  || ((INSTANCE) == MDF1_Filter1_S) || \
                                       ((INSTANCE) == MDF1_Filter2_NS)  || ((INSTANCE) == MDF1_Filter2_S) || \
                                       ((INSTANCE) == MDF1_Filter3_NS)  || ((INSTANCE) == MDF1_Filter3_S) || \
                                       ((INSTANCE) == MDF1_Filter4_NS)  || ((INSTANCE) == MDF1_Filter4_S) || \
                                       ((INSTANCE) == MDF1_Filter5_NS)  || ((INSTANCE) == MDF1_Filter5_S) || \
                                       ((INSTANCE) == MDF1_Filter6_NS)  || ((INSTANCE) == MDF1_Filter6_S) || \
                                       ((INSTANCE) == MDF1_Filter7_NS)  || ((INSTANCE) == MDF1_Filter7_S) || \
                                       ((INSTANCE) == ADF1_Filter0_NS)  || ((INSTANCE) == ADF1_Filter0_S))

/******************************* PSSI Instances ********************************/
#define IS_PSSI_ALL_INSTANCE(INSTANCE) (((INSTANCE) == PSSI_S) || ((INSTANCE) == PSSI_NS))

/****************************** RAMCFG Instances ********************************/
#define IS_RAMCFG_ALL_INSTANCE(INSTANCE) (((INSTANCE) == RAMCFG_SYSRAM_NS)  || ((INSTANCE) == RAMCFG_SYSRAM_S)  || \
                                          ((INSTANCE) == RAMCFG_SRAM1_NS)   || ((INSTANCE) == RAMCFG_SRAM1_S)   || \
                                          ((INSTANCE) == RAMCFG_RETRAM_NS)  || ((INSTANCE) == RAMCFG_RETRAM_S)  || \
                                          ((INSTANCE) == RAMCFG_BKPSRAM_NS) || ((INSTANCE) == RAMCFG_BKPSRAM_S))

/***************************** RAMCFG ECC Instances *****************************/
#define IS_RAMCFG_ECC_INSTANCE(INSTANCE) (((INSTANCE) == RAMCFG_RETRAM_NS)  || ((INSTANCE) == RAMCFG_RETRAM_S)  || \
                                          ((INSTANCE) == RAMCFG_BKPSRAM_NS) || ((INSTANCE) == RAMCFG_BKPSRAM_S))

/***************************** RAMCFG IT Instances ******************************/
#define IS_RAMCFG_IT_INSTANCE(INSTANCE) (((INSTANCE) == RAMCFG_RETRAM_NS)  || ((INSTANCE) == RAMCFG_RETRAM_S)  || \
                                         ((INSTANCE) == RAMCFG_BKPSRAM_NS) || ((INSTANCE) == RAMCFG_BKPSRAM_S))

/************************ RAMCFG CRC Instances *********************/
#define IS_RAMCFG_CRC_INSTANCE(INSTANCE) (((INSTANCE) == RAMCFG_RETRAM_NS)  || ((INSTANCE) == RAMCFG_RETRAM_S))

/******************************* RNG Instances ********************************/
#define IS_RNG_ALL_INSTANCE(INSTANCE) (((INSTANCE) == RNG1_S) || ((INSTANCE) == RNG1_NS) || ((INSTANCE) == RNG2_S) || \
                                        ((INSTANCE) == RNG2_NS))

/******************************* RTC Instances ********************************/
#define IS_RTC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == RTC_S) || ((INSTANCE) == RTC_NS))

/****************************** SAI Instances ********************************/
#define IS_SAI_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SAI1_Block_A_S) || ((INSTANCE) == SAI1_Block_A_NS) || \
                                       ((INSTANCE) == SAI1_Block_B_S) || ((INSTANCE) == SAI1_Block_B_NS) || \
                                       ((INSTANCE) == SAI2_Block_A_S) || ((INSTANCE) == SAI2_Block_A_NS) || \
                                       ((INSTANCE) == SAI2_Block_B_S) || ((INSTANCE) == SAI2_Block_B_NS) || \
                                       ((INSTANCE) == SAI3_Block_A_S) || ((INSTANCE) == SAI3_Block_A_NS) || \
                                       ((INSTANCE) == SAI3_Block_B_S) || ((INSTANCE) == SAI3_Block_B_NS) || \
                                       ((INSTANCE) == SAI4_Block_A_S) || ((INSTANCE) == SAI4_Block_A_NS) || \
                                       ((INSTANCE) == SAI4_Block_B_S) || ((INSTANCE) == SAI4_Block_B_NS))

/******************************** SDMMC Instances *****************************/
#define IS_SDMMC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SDMMC1_S) || ((INSTANCE) == SDMMC1_NS) || \
                                         ((INSTANCE) == SDMMC2_S) || ((INSTANCE) == SDMMC1_NS) || \
                                         ((INSTANCE) == SDMMC3_S) || ((INSTANCE) == SDMMC1_NS))

/******************************* SPDIFRX Instances ****************************/
#define IS_SPDIFRX_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SPDIFRX_S) || ((INSTANCE) == SPDIFRX_NS))

